Reports/ДонесениеОКоличествеГражданПребывающихВЗапасе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Report>
		<Properties>
			<Name>ДонесениеОКоличествеГражданПребывающихВЗапасе</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПараметрОтбора</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Enums/ГодностьКВоеннойСлужбе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ГодностьКВоеннойСлужбе</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Годен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГоденСОграничениями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОграниченноГоден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременноНеГоден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеГоден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГоденКНестроевой</Name>
					<Comment>ГНС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеГоденСИсключением</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ОтношениеКВоинскойОбязанности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ОтношениеКВоинскойОбязанности</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Военнообязанный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВоеннообязанный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Призывник</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/КатегорииДолжностейДляВоинскогоУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>КатегорииДолжностейДляВоинскогоУчета</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководители</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпециалистыСХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпециалистыТорговлиИОбщепита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпециалистыНауки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпециалистыКультуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпециалистыОбразования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Врачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СреднийМедицинскийПерсонал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДругиеСлужащие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рабочие1_2Разрядов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рабочие3_4Разрядов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рабочие5РазрядаИВыше</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РабочиеНеИмеющиеТарифныхСтавок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РабочиеСХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РабочиеЛокомотивныхБригад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Водители</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Трактористы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Учащиеся</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеСпециалисты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРабочие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ДонесениеОКоличествеГражданПребывающихВЗапасе/Ext/ObjectModule.bsl
#Если Клиент Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
Перем мНазваниеОтчета Экспорт;

// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом,
//	ЕстьОшибки - флаг того, что при формировании произошли ошибки
//
Процедура СформироватьОтчет(ДокументРезультат, ЕстьОшибки) Экспорт
	
	ОтборВоенкомат = ТипЗнч(ПараметрОтбора) = Тип("Структура");
	Если ОтборВоенкомат Тогда
		ОтборВоенкомат			= ПараметрОтбора.ФлажокНастройкиВоенкомат;
		ВидСравненияВоенкомат	= ПараметрОтбора.ПолеВидаСравненияВоенкомат;
		Военкомат				= ПараметрОтбора.ПолеНастройкиВоенкомат;
		Организация				= ПараметрОтбора.Организация;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	УсловиеПоРегиструВоинскогоУчета = "&ДатаАктуальности,";
	
	Если ОтборВоенкомат Тогда
		
		Запрос.УстановитьПараметр("Военкомат", Военкомат);
	
		Если ВидСравненияВоенкомат = ВидСравнения.Равно Тогда
			ВидСравненияСтрокой = "=" 
		ИначеЕсли ВидСравненияВоенкомат = ВидСравнения.НеРавно Тогда
			ВидСравненияСтрокой = "<>"
		ИначеЕсли ВидСравненияВоенкомат = ВидСравнения.ВСписке Тогда
			ВидСравненияСтрокой = "В"
		ИначеЕсли ВидСравненияВоенкомат = ВидСравнения.НеВСписке Тогда
			ВидСравненияСтрокой = "НЕ В"
		КонецЕсли;
		
		УсловиеПоРегиструВоинскогоУчета =  УсловиеПоРегиструВоинскогоУчета + "Военкомат " + ВидСравненияСтрокой + " (&Военкомат)"
		
	КонецЕсли;
	
	СписокОфицерскихЗваний	=	Новый СписокЗначений;
	СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.МладшийЛейтенант);
	СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.Лейтенант);
	СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.СтаршийЛейтенант);
	СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.Капитан);
	СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.Майор);
	СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.Подполковник);
	СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.Полковник);
	СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.ГенералМайор);
	СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.ГенералЛейтенант);
	СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.ГенералПолковник);
	СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.ГенералАрмии);
	СписокОфицерскихЗваний.Добавить(Справочники.ВоинскиеЗвания.МаршалРоссийскойФедерации);
	
	СписокЗванийПрапорщиков	=	Новый СписокЗначений;
	СписокЗванийПрапорщиков.Добавить(Справочники.ВоинскиеЗвания.Прапорщик);
	СписокЗванийПрапорщиков.Добавить(Справочники.ВоинскиеЗвания.СтаршийПрапорщик);
	СписокЗванийПрапорщиков.Добавить(Справочники.ВоинскиеЗвания.МладшийСержант);
	СписокЗванийПрапорщиков.Добавить(Справочники.ВоинскиеЗвания.Сержант);
	СписокЗванийПрапорщиков.Добавить(Справочники.ВоинскиеЗвания.СтаршийСержант);
	СписокЗванийПрапорщиков.Добавить(Справочники.ВоинскиеЗвания.Старшина);
	
	СписокСолдатскихЗваний	=	Новый СписокЗначений;
	СписокСолдатскихЗваний.Добавить(Справочники.ВоинскиеЗвания.Рядовой);
	СписокСолдатскихЗваний.Добавить(Справочники.ВоинскиеЗвания.Ефрейтор);
	
	СписокГодныеКСлужбе = Новый СписокЗначений;
	СписокГодныеКСлужбе.Добавить(Перечисления.ГодностьКВоеннойСлужбе.Годен);
	СписокГодныеКСлужбе.Добавить(Перечисления.ГодностьКВоеннойСлужбе.ГоденСОграничениями);
	СписокГодныеКСлужбе.Добавить(Перечисления.ГодностьКВоеннойСлужбе.ОграниченноГоден);
	
	Запрос.УстановитьПараметр("ДатаАктуальности",	ДатаАктуальности);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("Офицеры",			СписокОфицерскихЗваний);
	Запрос.УстановитьПараметр("Прапорщики",			СписокЗванийПрапорщиков);
	Запрос.УстановитьПараметр("Солдаты",			СписокСолдатскихЗваний);
	Запрос.УстановитьПараметр("Военнообязанный",	Перечисления.ОтношениеКВоинскойОбязанности.Военнообязанный);
	Запрос.УстановитьПараметр("СписокГодныеКСлужбе",СписокГодныеКСлужбе);
	Запрос.УстановитьПараметр("До30лет",			ДобавитьМесяц(ДатаАктуальности, -12*30));
	Запрос.УстановитьПараметр("До35лет",			ДобавитьМесяц(ДатаАктуальности, -12*35));
	Запрос.УстановитьПараметр("До40лет",			ДобавитьМесяц(ДатаАктуальности, -12*40));
	Запрос.УстановитьПараметр("До45лет",			ДобавитьМесяц(ДатаАктуальности, -12*45));
	Запрос.УстановитьПараметр("До50лет",			ДобавитьМесяц(ДатаАктуальности, -12*50));
	Запрос.УстановитьПараметр("Призывник",			Перечисления.ОтношениеКВоинскойОбязанности.Призывник);
	Запрос.УстановитьПараметр("Руководители",		Перечисления.КатегорииДолжностейДляВоинскогоУчета.Руководители);
	Запрос.УстановитьПараметр("Специалисты",		Перечисления.КатегорииДолжностейДляВоинскогоУчета.СпециалистыСХ);
	Запрос.УстановитьПараметр("ДругиеСлужащие",		Перечисления.КатегорииДолжностейДляВоинскогоУчета.ДругиеСлужащие);
	Запрос.УстановитьПараметр("Рабочие",			Перечисления.КатегорииДолжностейДляВоинскогоУчета.РабочиеСХ);
	
	ТекстОсновногоЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РаботникиОрганизации.Должность.КатегорияВоинскогоУчета КАК ДолжностьКатегория,
	|	СУММА(1) КАК ВсегоРаботающих,
	|	СУММА(ВЫБОР КОГДА ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ВсегоВЗапасе,
	|	СУММА(ВЫБОР КОГДА ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И ВУ.Звание.ОбщевойсковоеЗвание В (&Офицеры) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ОфицеровВЗапасе,
	|	СУММА(ВЫБОР КОГДА ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И ВУ.Звание.ОбщевойсковоеЗвание В (&Прапорщики) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ПрапорщиковВЗапасе,
	|	СУММА(ВЫБОР КОГДА ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И ВУ.Звание.ОбщевойсковоеЗвание В (&Солдаты) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК СолдатВЗапасе,
	|	СУММА(ВЫБОР КОГДА ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И НЕ(ВУ.Годность В (&СписокГодныеКСлужбе)) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ПрапорщиковСолдатОграниченноГодныхВЗапасе,
	|	СУММА(ВЫБОР КОГДА ВУ.ЗабронированОрганизацией = &Организация И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ВсегоВЗапасеЗабронировано,
	|	СУММА(ВЫБОР КОГДА ВУ.ЗабронированОрганизацией = &Организация И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И ВУ.Звание.ОбщевойсковоеЗвание В (&Офицеры) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ОфицеровЗабронировано,
	|	СУММА(ВЫБОР КОГДА ВУ.ЗабронированОрганизацией = &Организация И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И (ВУ.Звание.ОбщевойсковоеЗвание В (&Прапорщики) ИЛИ ВУ.Звание.ОбщевойсковоеЗвание В (&Солдаты)) И РаботникиОрганизации.ФизЛицо.ДатаРождения > &До30лет ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ПрапорщиковСолдатДо30Забронировано,
	|	СУММА(ВЫБОР КОГДА ВУ.ЗабронированОрганизацией = &Организация И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И (ВУ.Звание.ОбщевойсковоеЗвание В (&Прапорщики) ИЛИ ВУ.Звание.ОбщевойсковоеЗвание В (&Солдаты)) И РаботникиОрганизации.ФизЛицо.ДатаРождения > &До35лет И РаботникиОрганизации.ФизЛицо.ДатаРождения <= &До30лет ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ПрапорщиковСолдатОт31До35Забронировано,
	|	СУММА(ВЫБОР КОГДА ВУ.ЗабронированОрганизацией = &Организация И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И (ВУ.Звание.ОбщевойсковоеЗвание В (&Прапорщики) ИЛИ ВУ.Звание.ОбщевойсковоеЗвание В (&Солдаты)) И РаботникиОрганизации.ФизЛицо.ДатаРождения > &До40лет И РаботникиОрганизации.ФизЛицо.ДатаРождения <= &До35лет ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ПрапорщиковСолдатОт36До40Забронировано,
	|	СУММА(ВЫБОР КОГДА ВУ.ЗабронированОрганизацией = &Организация И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И (ВУ.Звание.ОбщевойсковоеЗвание В (&Прапорщики) ИЛИ ВУ.Звание.ОбщевойсковоеЗвание В (&Солдаты)) И РаботникиОрганизации.ФизЛицо.ДатаРождения > &До45лет И РаботникиОрганизации.ФизЛицо.ДатаРождения <= &До40лет ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ПрапорщиковСолдатОт41До45Забронировано,
	|	СУММА(ВЫБОР КОГДА ВУ.ЗабронированОрганизацией = &Организация И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И (ВУ.Звание.ОбщевойсковоеЗвание В (&Прапорщики) ИЛИ ВУ.Звание.ОбщевойсковоеЗвание В (&Солдаты)) И РаботникиОрганизации.ФизЛицо.ДатаРождения > &До50лет И РаботникиОрганизации.ФизЛицо.ДатаРождения <= &До45лет ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ПрапорщиковСолдатОт46До50Забронировано,
	|	СУММА(ВЫБОР КОГДА НЕ(ВУ.ЗабронированОрганизацией = &Организация) И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И НЕ(ВУ.НаличиеМобпредписания) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК НезабронированноБезМобпредписаний,
	|	СУММА(ВЫБОР КОГДА НЕ(ВУ.ЗабронированОрганизацией = &Организация) И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И ВУ.НаличиеМобпредписания ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК НезабронированноСМобпредписанием,
	|	СУММА(ВЫБОР КОГДА НЕ(ВУ.ЗабронированОрганизацией = &Организация) И ВУ.ОтношениеКВоинскойОбязанности = &Военнообязанный И ВУ.НаличиеМобпредписания И ВУ.Звание.ОбщевойсковоеЗвание В (&Офицеры) ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК НезабронированноОфицеровСМобпредписанием,
	|	СУММА(ВЫБОР КОГДА ВУ.ОтношениеКВоинскойОбязанности = &Призывник ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК Призывников
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаАктуальности
	|					И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацииСрезПоследних.ДолжностьЗавершения
	|			ИНАЧЕ РаботникиОрганизацииСрезПоследних.Должность 
	|		КОНЕЦ КАК Должность,
	|		РаботникиОрганизацииСрезПоследних.Сотрудник.Физлицо КАК ФизЛицо
	|	ИЗ
	|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Организация = &ГоловнаяОрганизация И Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)) КАК РаботникиОрганизацииСрезПоследних
	|	
	|	ГДЕ
	|		ВЫБОР
	|			КОГДА  РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаАктуальности
	|			И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацииСрезПоследних.ОбособленноеПодразделениеЗавершения
	|			ИНАЧЕ РаботникиОрганизацииСрезПоследних.ОбособленноеПодразделение
	|		КОНЕЦ = &Организация И
	|		ВЫБОР
	|			КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &ДатаАктуальности
	|			И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацииСрезПоследних.ПричинаИзмененияСостоянияЗавершения
	|			ИНАЧЕ РаботникиОрганизацииСрезПоследних.ПричинаИзмененияСостояния 
	|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)) КАК РаботникиОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВоинскийУчет.СрезПоследних(" + УсловиеПоРегиструВоинскогоУчета + ") КАК ВУ
	|		ПО РаботникиОрганизации.ФизЛицо = ВУ.Физлицо
	|
	|СГРУППИРОВАТЬ ПО
	|	РаботникиОрганизации.Должность.КатегорияВоинскогоУчета";
	
	ДокументРезультат.Очистить();
	Макет 			= ПолучитьМакет("Форма11МУ");
	ОбластьШапка 	= Макет.ПолучитьОбласть("ШапкаФормы11МУ");
	ОбластьШапка.Параметры.НаДату				= "По состоянию на " + Формат(ДатаАктуальности, "ДЛФ=DD");
	ОбластьШапка.Параметры.Организация			= "по " + Организация.Наименование + ?(ОтборВоенкомат," (данные по: " + Военкомат + ")","");
	ДокументРезультат.Присоединить(ОбластьШапка);
	
	Запрос.Текст = ТекстОсновногоЗапроса + "
	|ИТОГИ ПО ОБЩИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка	=	РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() тогда
		ОбластьСтрока 	= Макет.ПолучитьОбласть("СтрокаФормы11МУ");
		ОбластьСтрока.Параметры.ОрганизацияНаименование							= Организация.Наименование;
		ОбластьСтрока.Параметры.ВсегоРаботающих									= Выборка.ВсегоРаботающих;
		ОбластьСтрока.Параметры.ВсегоВЗапасе 									= Выборка.ВсегоВЗапасе;
		ОбластьСтрока.Параметры.ОфицеровВЗапасе 								= Выборка.ОфицеровВЗапасе;
		ОбластьСтрока.Параметры.ВсегоВЗапасеЗабронировано 						= Выборка.ВсегоВЗапасеЗабронировано;
		ОбластьСтрока.Параметры.ОфицеровЗабронировано 							= Выборка.ОфицеровЗабронировано;
		Если Выборка.ВсегоВЗапасе <> 0 тогда
			ОбластьСтрока.Параметры.ЗабронированоПроцент				= (Выборка.ВсегоВЗапасеЗабронировано / Выборка.ВсегоВЗапасе)*100;
			ОбластьСтрока.Параметры.НезабронированноСМобпредписаниемПроцент	= (Выборка.НезабронированноСМобпредписанием / Выборка.ВсегоВЗапасе)*100;
		КонецЕсли;
		ОбластьСтрока.Параметры.НезабронированноСМобпредписанием 				= Выборка.НезабронированноСМобпредписанием;
		ОбластьСтрока.Параметры.НезабронированноОфицеровСМобпредписанием		= Выборка.НезабронированноОфицеровСМобпредписанием;
		ОбластьСтрока.Параметры.Призывников										= Выборка.Призывников;
		ДокументРезультат.Присоединить(ОбластьСтрока);
	КонецЕсли;
	
	ОбластьПодвал	=	Макет.ПолучитьОбласть("ПодвалФормы11МУ");
	Исполнитель	=	"";
	СтруктураОтветственныхЛиц = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Организация,ДатаАктуальности,Исполнитель);
	ОбластьПодвал.Параметры.ДолжностьРуководителя = СтруктураОтветственныхЛиц.РуководительДолжность;
	ОбластьПодвал.Параметры.ФИОРуководителя		  = СтруктураОтветственныхЛиц.Руководитель;
	
	
	Если ТипЗнч(ОбластьПодвал)	=	Тип("ТабличныйДокумент")	тогда
		ДокументРезультат.Присоединить(ОбластьПодвал);
	КонецЕсли;
	
	//Параметры документа
	ДокументРезультат.Автомасштаб 			= Истина;
	ДокументРезультат.ОриентацияСтраницы 	= ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.Защита              	= Ложь;
	
КонецПроцедуры

мНазваниеОтчета = "Донесение о количестве граждан пребывающих в запасе";

#КонецЕсли
